{
    "result": "succeed",
    "books": [
        {
            "amount": 2,
            "location": "2号书架4层5格",
            "subtitle": "",
            "author": [
                "李东博"
            ],
            "pubdate": "2013-6-1",
            "tags": [
                "HTML5",
                "CSS3",
                "HTML5+CSS3从入门到精通",
                "Web开发",
                "技术",
                "计算机",
                "前端",
                "编程"
            ],
            "origin_title": "",
            "pages": "548",
            "images": {
                "small": "https://img1.doubanio.com\/spic\/s28374198.jpg",
                "large": "https://img1.doubanio.com\/lpic\/s28374198.jpg",
                "medium": "https://img1.doubanio.com\/mpic\/s28374198.jpg"
            },
            "alt": "https:\/\/book.douban.com\/subject\/24708139\/",
            "publisher": "清华大学出版社",
            "isbn13": "9787302308812",
            "title": "HTML5+CSS3从入门到精通",
            "alt_title": "",
            "summary": "《HTML5+CSS3从入门到精通》（清华社“视频大讲堂”大系）通过基础知识+中小实例+综合案例的方式，\n讲述了用HTML5+ CSS3设计构建网站的必备知识，相对于权威指南、高级程序设计、开发指南同类图书，本书是一本适合快速入手的自学教程。内容有：创建HTML5文档，实战HTML5表单，实战HTML5绘画，HTML5音频与视频，Web存储，离线应用，Workers多线程处理，Geolocation地理位置等技术。CSS3部分主要介绍了CSS3概述，CSS选择器，文本、字体与颜色，背景和边框，2D变形，设计动画，网页布局、用户界面以及CSS3的其他新特性。\n《HTML5+CSS3从入门到精通》内容涵盖了HTML5+CSS3的所有重要特性，通过大量实际案例对HTML5+CSS3的重要特性进行了详细讲解，内容全面丰富，易于理解，能够帮助读者提升实际应用技能。\n本书内容翔实、结构清晰、循序渐进，基础知识与案例实战紧密结合，既可作为HTML5+CSS3初学者的入门教材，也适合作为中高级用户对新技术作进一步学习的参考用书。本书显著特色有：\n1．同步视频讲解，让学习更为直观高效。227节大型高清同步视频讲解，先看视频再学习效率更高。\n2．海量精彩实例，用实例学更轻松快捷。225个精彩实例，模仿练习是最快捷的学习方式。\n3．精选实战案例，为高薪就业牵线搭桥。31个实战案例展示可为以后就业积累经验。\n4．完整学习套餐，为读者提供贴心服务。参考手册11部、网页模版83类、素材源程序，让学习更加方便。\n5．讲解通俗翔实，看得懂学得会才是硬道理。",
            "price": "CNY 69.80"
        }
    ]
}

